package step04;

public class Exam042_3 {
  public static void main(String[] args) {
    //문제 : 이력서에 프로그래밍 가능한 항목을 입력 받기.
     //=> 프로그래밍 보기
     //   Java, JavaScript, JVM, CSS, c, c++, Python, Perl, VB, R, Groovy,
     //   XML, Scala, Ruby, Swift, Object-C, Pascal, #c fo

    /*byte[] language = new byte[] {
        1, 1, 1, 1, 0, 1, 1, 1, 1, 1,
        0, 1, 1, 0, 0, 0, 1, 1, 0, 0};
    */

    int language = 0b00000000_00001111_01111101_10001100;
    //               00000000_00001000_00000000_00000000; //Java
    //               00000000_00000100_00000000_00000000; //JavaScript
    //               00000000_00000010_00000000_00000000; //HTML
    //               00000000_00000001_00000000_00000000; //CSS
    //               00000000_00000000_10000000_00000000; //C
    //               00000000_00000000_01000000_00000000; //C++

    //Java, C, C++을 할 줄 아는 사람인지 검사하라.
    //Java + C + C++ = 0b00000000_00001000_11000000_00000000
    /* 계산 예
      0b00000000_00001111_11111101_10001100
    & 0b00000000_00001000_11000000_00000000
    ---------------------------------------
        00000000_00001000_11000000_00000000
    */

    String result = ((language & 0x00_08_C0_00) == 0x00_08_C0_00) ? "yes" : "no";
    //                           0x8C000           0x8C000
    System.out.println(result);
  }
}
